prod-deploy/debug/juicefs-03-8-flush-race-community/community-submission/raw-test-data/V02/juicefs-v02-20260819-110158/integrity/fio.txt
v02verify: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 4 processes
v02verify: Laying out IO file (1 file / 4096MiB)
v02verify: Laying out IO file (1 file / 4096MiB)
v02verify: Laying out IO file (1 file / 4096MiB)
[...]

v02verify: (groupid=0, jobs=4): err= 0: pid=3567507: Wed Aug 19 23:25:46 2026
  read: IOPS=3066, BW=767MiB/s (804MB/s)(16.0GiB/21374msec)
    slat (usec): min=43, max=6911, avg=1243.75, stdev=216.45
    clat (usec): min=42, max=80700, avg=39871.67, stdev=4365.61
     lat (usec): min=166, max=83302, avg=41115.56, stdev=4496.87
    clat percentiles (usec):
     |  1.00th=[36439],  5.00th=[37487], 10.00th=[38011], 20.00th=[38536],
     | 30.00th=[38536], 40.00th=[39060], 50.00th=[39060], 60.00th=[39584],
     | 70.00th=[40109], 80.00th=[40109], 90.00th=[41157], 95.00th=[42206],
     | 99.00th=[67634], 99.50th=[70779], 99.90th=[76022], 99.95th=[78119],
     | 99.99th=[80217]
  write: IOPS=4285, BW=1071MiB/s (1123MB/s)(16.0GiB/15292msec); 0 zone resets
    slat (usec): min=114, max=113589, avg=871.66, stdev=1426.52
    clat (nsec): min=1515, max=180818k, avg=27998786.87, stdev=12170088.00
     lat (usec): min=193, max=181026, avg=28870.59, stdev=12443.85
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[   21], 20.00th=[   25],
     | 30.00th=[   26], 40.00th=[   27], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   30], 80.00th=[   31], 90.00th=[   34], 95.00th=[   39],
     | 99.00th=[   71], 99.50th=[  107], 99.90th=[  161], 99.95th=[  174],
     | 99.99th=[  180]
   bw (  MiB/s): min=  434, max= 2102, per=98.78%, avg=1058.29, stdev=84.73, samples=62
   iops        : min= 2644, max=11972, avg=4374.46, stdev=386.38, samples=120
  lat (usec)   : 2=0.01%, 4=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=3.90%, 20=1.13%, 50=92.46%
  lat (msec)   : 100=2.22%, 250=0.26%
  cpu          : usr=6.79%, sys=0.79%, ctx=131309, majf=2, minf=11013
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=767MiB/s (804MB/s), 767MiB/s-767MiB/s (804MB/s-804MB/s), io=16.0GiB (17.2GB), run=21374-21374msec
  WRITE: bw=1071MiB/s (1123MB/s), 1071MiB/s-1071MiB/s (1123MB/s-1123MB/s), io=16.0GiB (17.2GB), run=15292-15292msec